MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX110F016B.atdf
         <register caption="Data RAM User Program Base Address Register" name="BMXDUPBA" offset="0x30" rw="RW" size="4">
            <bitfield caption="DRM User Program Base Address bits (bits 15-10, bits 9-0 are read only)" mask="0xFFFFFFFF" name="BMXDUPBA" values="BMXDUPBA__BMXDUPBA" />
         </register>
         <register caption="Data RAM Size Register" name="BMXDRMSZ" offset="0x40" rw="R" size="4">
            <bitfield caption="Data RAM Memory Size bits" mask="0xFFFFFFFF" name="BMXDRMSZ" values="BMXDRMSZ__BMXDRMSZ" />
         </register>
         <register caption="Program Flash (PFM) User Program Base Address Register" name="BMXPUPBA" offset="0x50" rw="RW" size="4">
            <bitfield caption="Program Flash (PFM) User Program Base Address bits (bits 19-11, bits 10-0 are read only)" mask="0xFFFFFFFF" name="BMXPUPBA" values="BMXPUPBA__BMXPUPBA" />
         </register>
         <register caption="Program Flash (PFM) Size Register" name="BMXPFMSZ" offset="0x60" rw="R" size="4">
            <bitfield caption="Program Flash Memory (PFM) Size bits" mask="0xFFFFFFFF" name="BMXPFMSZ" values="BMXPFMSZ__BMXPFMSZ" />
         </register>
         <register caption="Boot Flash (IFM) Size Register" name="BMXBOOTSZ" offset="0x70" rw="R" size="4">
            <bitfield caption="Boot Flash Memory Size bits" mask="0xFFFFFFFF" name="BMXBOOTSZ" values="BMXBOOTSZ__BMXBOOTSZ" />
         </register>
      </register-group>
      <value-group caption="Bus Matrix Arbitration Mode bits" name="BMXCON__BMXARB">
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x7" />
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x6" />
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x5" />
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x4" />
         <value caption="Reserved (using these configuration modes will produce undefined behavior)" name="" value="0x3" />
         <value caption="Arbitration Mode 2" name="" value="0x2" />
         <value caption="Arbitration Mode 1 (default)" name="" value="0x1" />
         <value caption="Arbitration Mode 0" name="" value="0x0" />
      </value-group>
      <value-group caption="CPU Instruction or Data Access from Data RAM Wait State bit" name="BMXCON__BMXWSDRM">
         <value caption="Data RAM accesses from CPU have one wait state for address setup" name="" value="0x1" />
         <value caption="Data RAM accesses from CPU have zero wait states for address setup" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error from CPU Instruction Access bit" name="BMXCON__BMXERRIS">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from CPU instruction access" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from CPU instruction access" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error from CPU Data Access bit" name="BMXCON__BMXERRDS">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from CPU data access" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from CPU data access" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error from DMA bit" name="BMXCON__BMXERRDMA">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from DMA" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from DMA" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Bus Error from ICD Debug Unit bit" name="BMXCON__BMXERRICD">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from ICD" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from ICD" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Bus Error from IXI bit" name="BMXCON__BMXERRIXI">
         <value caption="Enable bus error exceptions for unmapped address accesses initiated from IXI shared bus" name="" value="0x1" />
         <value caption="Disable bus error exceptions for unmapped address accesses initiated from IXI shared bus" name="" value="0x0" />
      </value-group>
      <value-group caption="DRM Kernel Program Base Address bits (bits 15-10, bits 9-0 are read only)" name="BMXDKPBA__BMXDKPBA">
         <value caption="No relative base address set" name="" value="0x0" />
      </value-group>
      <value-group caption="DRM User Data Base Address bits (bits 15-10, bits 9-0 are read only)" name="BMXDUDBA__BMXDUDBA">
         <value caption="No relative base address set" name="" value="0x0" />
      </value-group>
      <value-group caption="DRM User Program Base Address bits (bits 15-10, bits 9-0 are read only)" name="BMXDUPBA__BMXDUPBA">
         <value caption="No relative base address set" name="" value="0x0" />
      </value-group>
      <value-group caption="Data RAM Memory Size bits" name="BMXDRMSZ__BMXDRMSZ">
         <value caption="Device has 16 KB RAM" name="" value="0x4000" />
         <value caption="Device has 32 KB RAM" name="" value="0x8000" />
         <value caption="Device has 64 KB RAM" name="" value="0x10000" />
         <value caption="Device has 128 KB RAM" name="" value="0x20000" />
      </value-group>
      <value-group caption="Program Flash (PFM) User Program Base Address bits (bits 19-11, bits 10-0 are read only)" name="BMXPUPBA__BMXPUPBA">
         <value caption="Base address set to 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Program Flash Memory (PFM) Size bits" name="BMXPFMSZ__BMXPFMSZ">
         <value caption="Device has 64 KB Flash" name="" value="0x10000" />
         <value caption="Device has 128 KB Flash" name="" value="0x20000" />
         <value caption="Device has 256 KB Flash" name="" value="0x40000" />
         <value caption="Device has 512 KB Flash" name="" value="0x80000" />
      </value-group>
      <value-group caption="Boot Flash Memory Size bits" name="BMXBOOTSZ__BMXBOOTSZ">
         <value caption="Device has 12 KB Boot Flash" name="" value="0x3000" />
      </value-group>
   </module>
